#include "delay.h" 
/*--------------------------------------------------------------*/
/* --- -----------------实验内容 -------------------------------*/
/* --- 1-了解STC-ISP工具生产延时函数方法 -----------------------*/
/* --- 2-掌握子函数的创建与调用---------------------------------*/
/* --- 实验平台：未来电子STC32核心板----------------------------*/
/* --- 视频学习：https://space.bilibili.com/494969171 ----------*/
/* --- QQ交流群：702805632 -------------------------------------*/
/* --- 参考资料：STC32实验室参考例程 ---------------------------*/
/*--------------------------------------------------------------*/

#define MAIN_Fosc        24000000UL   //定义主时钟 

//========================================================================
// 函数: void delay_ms(u8 ms)
// 描述: 延时函数。
// 参数: ms,要延时的ms数 自动适应主时钟.
// 返回: none.
// 版本: VER1.0
// 日期: 2022-9-24
// 备注: 
//========================================================================
void delay_ms(unsigned int ms)
{
    unsigned int  i;
    do{
        i = MAIN_Fosc / 6000;
        while(--i);   //6T per loop
      }while(--ms);
}

//========================================================================
// 函数: void delay_n_ms(u8 ms)
// 描述: 延时函数。
// 参数: 支持至65535ms. 自动适应主时钟.
// 返回: none.
// 版本: VER1.0
// 日期: 2023-4-24
// 备注: 
//========================================================================
void delay_n_ms(unsigned short int ms)
{
	unsigned char	batch;
	unsigned char remnant;
	
	batch = ms/255;
	remnant = ms%255;
	
	while(batch){
		delay_ms(255);
		batch--;
	}
	delay_ms(remnant);
}






